---
kind: type
id: T:Autodesk.Revit.UI.DockablePaneId
source: html/96149d8e-6393-9285-a721-76470e6c15b8.htm
---
# Autodesk.Revit.UI.DockablePaneId

Identifier for a pane that participates in the Revit docking window system.

## Syntax (C#)
```csharp
public class DockablePaneId : GuidEnum
```